app/views/home/_friendslist.html.erb

SELECT "users"."uid" FROM "users" WHERE (id in (11))
---
				          				<%
								  			@u1 = User.where("uid = (?)", item[0]).pluck(:id)